In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
train_df = pd.read_csv('train.csv')
test_df = pd.read_csv('test.csv')

In [3]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [5]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

Since we see that Column 'Cabin' has almost 75-80 % null values. So, We are going to drop this column and also try to encode values to the age column, as this also have some null values present.

In [6]:
train_df['Age'] = train_df['Age'].fillna(np.mean(train_df['Age']))
train_df.dropna(inplace=True)

test_df['Age'] = test_df['Age'].fillna(np.mean(test_df['Age']))
test_df.dropna(inplace=True)

Now, If we look at our data, we can say that Name of passenger and the Ticket of passenger are not important features to make predictions and so the PassengerId column, in the thier survival. So, Lets drop them too and try to train our model.

In [7]:
train_df.drop(columns=['Cabin','Name','Ticket','PassengerId'], inplace=True)

test_df.drop(columns=['Cabin','Name','Ticket','PassengerId'], inplace=True)

In [8]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 202 entries, 1 to 889
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  202 non-null    int64
 1   Pclass    202 non-null    int64
 2   Sex       202 non-null    object
 3   Age       202 non-null    float64
 4   SibSp     202 non-null    int64
 5   Parch     202 non-null    int64
 6   Fare      202 non-null    float64
 7   Embarked  202 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 14.2+ KB

In [9]:
train_df = pd.get_dummies(train_df)
test_df = pd.get_dummies(test_df)

In [27]:
Y_tdf = train_df['Survived']
X_tdf = train_df.drop(columns=['Survived'])

In [32]:
from sklearn.svm import SVC

model = SVC(C=1, kernel='linear')

In [33]:
model.fit(X_tdf, Y_tdf)

SVC(C=1, kernel='linear')

In [36]:
y_pred = model.predict(test_df)
y_pred

array([1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1,
       0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0],
      dtype=int64)

In [37]:
model.score(X_tdf, Y_tdf)

0.7871287128712872